'use strict'

// {
//   const revenue = +prompt('Введите сумму дохода');

//   if (revenue <= 15000 && revenue > 0) {
//     let sum = revenue * 0.13;
//     console.log(`Налог 13%. С дохода ${revenue} ₽. сумма налога составит ${sum} ₽.`);
//   }

//   if (revenue > 15000 && revenue <= 50000) {
//     let sum = ((revenue - 15000) * 0.2 + 15000 * 0.13);
//     console.log(`
//     Налог 13% на доход до 15 000 ₽. составит: ${15000 * 0.13} ₽..
//     Налог 20% на доход выше 15 000 ₽ составит: ${(revenue - 15000) * 0.2} ₽.
//     Общая сумма налога составит ${sum} ₽.
//     `);
//   }

//   if (revenue > 50000) {
//     let sum = ((revenue - 50000) * 0.3 + 15000 * 0.13 + ((50000 - 15000) * 0.2));
//     console.log(`
//     Налог 13% на доход до 15 000 ₽. составит: ${15000 * 0.13} ₽..
//     Налог 20% на доход выше 15 000 ₽ составит: ${(50000 - 15000) * 0.2} ₽.
//     Общая сумма налога составит ${sum} ₽.
//     `);
//   }
// }